# GenericFailures Properties

---
The BuiltInFailuresGenericFailures type exposes the following members.
| Name| Description
---|---|---
| ElementsInInvalidContext|  There are elements in the document that exist in a context they should not. These elements must be deleted to continue using this project or family.
Top
#### Reference
BuiltInFailuresGenericFailures Class
Autodesk.Revit.DB Namespace